# Ejercicios Lectura 1
### Elaboró: Jorge Alberto Morúa Amaya
### Clave: 193699
### 16/02/2020

<h2 style="color:crimson">Ejercicios</h2>

Considerando que la relación dentro de la base de datos `nabla_python` tiene la siguiente estructura:

![relation](http://www.mysqltutorial.org/wp-content/uploads/2009/12/MySQL-Sample-Database-Schema.png)

In [3]:
#importamos las librerias
import pymysql
from pymysql.cursors import DictCursor
import pandas as pd

from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Date, ForeignKey,Text, Float
from datetime import datetime
from sqlalchemy.orm import sessionmaker
from sqlalchemy import func
passw = "maquina271"

In [4]:
#creamos la conexion hacia la base de datos
def open_conection(passw):
    """
    Esta funcion crea la conexion a la base de datos, el parametro de entrada es el password
    """    
    conn = pymysql.connect(host="db4free.net",              
                           user="nabla123",
                           port=3306,
                           password=passw,
                           database="nabla_python",
                           charset="utf8",
                           cursorclass=DictCursor)
    return conn
    
def ejecuta_query(query,conn):
    """
    Esta funcion ejecuta la consulta que le pasamos por el parametro query y utiliza la conexion del parametro conn
    """ 
    with conn.cursor() as cursor:
        cursor.execute(query)
        query_result = cursor.fetchall()

    conn.close()
    return query_result

def SQl_Alchemy(passw):
    """
    Crea la conexion para usasr SQL Alchemy
    """ 
    engstr = f"mysql+pymysql://nabla123:{passw}@db4free.net:3306/nabla_python"
    engine = create_engine(engstr)

    Session = sessionmaker(bind=engine)
    return Session()

1. Realiza una consulta a la base de datos `nabla_python` por medio de `pymysql`: encuentra los tipos de `status` existentes dentro de la tabla `orders`.

---

In [5]:
query="""
SELECT distinct status,
        count(status) as tot_reg
FROM orders
group by status
order by tot_reg desc;
"""
conn = open_conection(passw)
qr_status = ejecuta_query(query,conn)

In [6]:
print('Los diferentes estatus que existen en la tabla ORDERS son:')
for reg in qr_status:
    print(reg['status'] + ' -->> Con un total de registros = ' + str(reg['tot_reg']))

Los diferentes estatus que existen en la tabla ORDERS son:
Shipped -->> Con un total de registros = 303
Cancelled -->> Con un total de registros = 6
In Process -->> Con un total de registros = 6
Resolved -->> Con un total de registros = 4
On Hold -->> Con un total de registros = 4
Disputed -->> Con un total de registros = 3

In [7]:
#visualizando la informacion con pandas
df_status = pd.DataFrame(qr_status)
df_status

       status  tot_reg
0     Shipped      303
1   Cancelled        6
2  In Process        6
3    Resolved        4
4     On Hold        4
5    Disputed        3

2. Realiza una consulta a la base de datos `nabla_python` por medio de `pymysql`: encuentra los 10 clientes `customerName` que más han comprado en la tienda. La tabla resultante deberá estar ordenada de mayor a menor con `customerName` y `expenses` como la columna en dónde se encuentre el monto gastado en la tienda. (**hint**: considera las tablas `customers` y `payments`)
----

In [8]:
query="""
SELECT  a.customerName, 
        sum(b.amount) as expenses
from customers a
inner join payments b on (a.customerNumber = b.customerNumber) 
group by  a.customerName
order by  expenses desc
limit 10
;
"""
conn = open_conection(passw)
qr_CTE_expenses = ejecuta_query(query,conn)

df_CTE_expenses = pd.DataFrame(qr_CTE_expenses)
df_CTE_expenses

                   customerName   expenses
0        Euro+ Shopping Channel  715738.98
1  Mini Gifts Distributors Ltd.  584188.24
2    Australian Collectors, Co.  180585.07
3            Muscle Machine Inc  177913.95
4       Dragon Souveniers, Ltd.  156251.03
5    Down Under Souveniers, Inc  154622.08
6                AV Stores, Co.  148410.09
7       Anna's Decorations, Ltd  137034.22
8      Corporate Gift Ideas Co.  132340.78
9        Saveley & Henriot, Co.  130305.35

3. Escribe una consulta que, para cada producto comprado muestre la clave del cliente `customerNumber` y el código del producto `productCode`. Obten los primeros 10 valores

---

In [9]:
query="""
SELECT  b.customerNumber,
        c.productCode
from orders b 
inner join orderdetails c on (b.orderNumber = c.orderNumber)
where b.status <>'Cancelled'
limit 10
;
"""
conn = open_conection(passw)
qr_product = ejecuta_query(query,conn)

df_product = pd.DataFrame(qr_product)
df_product

   customerNumber productCode
0             363    S18_1749
1             363    S18_2248
2             363    S18_4409
3             363    S24_3969
4             128    S18_2325
5             128    S18_2795
6             128    S24_1937
7             128    S24_2022
8             181    S18_1342
9             181    S18_1367

4. En base al ejercicio anterior, reemplaza `productCode` por `productName`. **HINT**: El comando `WITH` nos ayuda a crear una tabla temporal:

```SQL
WITH t1 as (
    SELECT ...
    )
SELECT t1.ci, t2.cj
FROM t2
JOIN t1 ON t1.cx = t2.cx
```

---

In [10]:
query="""
WITH t1 as (
            SELECT  b.customerNumber,
                    c.productCode
            from orders b 
            inner join orderdetails c on (b.orderNumber = c.orderNumber)
           where b.status <>'Cancelled'
            )
select t1.customerNumber,
    t2.productName
from products t2
inner join t1 on (t2.productCode = t1.productCode)
order by t1.customerNumber,
    t2.productName
limit 10
;
"""
conn = open_conection(passw)
qr_product_name = ejecuta_query(query,conn)

df_product_name = pd.DataFrame(qr_product_name)
df_product_name

   customerNumber                                productName
0             103        1936 Harley Davidson El Knucklehead
1             103  1938 Cadillac V-16 Presidential Limousine
2             103             1948 Porsche Type 356 Roadster
3             103                      1965 Aston Martin DB5
4             103                  1966 Shelby Cobra 427 S/C
5             103                      1996 Moto Guzzi 1100i
6             103               1999 Indy 500 Monte Carlo SS
7             112                         1911 Ford Town Car
8             112                   1917 Grand Touring Sedan
9             112        1932 Alfa Romeo 8C2300 Spider Sport


5. En base al ejercicio anterior, reemplaza `customerNumber` por `customerName`

----

In [11]:
query="""
WITH t1 as (
            SELECT  b.customerNumber,
                    c.productCode
            from orders b 
            inner join orderdetails c on (b.orderNumber = c.orderNumber)
            where b.status <>'Cancelled'
            )
select t3.customerName,
    t2.productName
from products t2
inner join t1 on (t2.productCode = t1.productCode)
inner join customers t3 on (t1.customerNumber = t3.customerNumber)
order by t1.customerNumber,
    t2.productName
limit 10
;
"""
conn = open_conection(passw)
qr_customerName = ejecuta_query(query,conn)

df_customerName = pd.DataFrame(qr_customerName)
df_customerName

         customerName                                productName
0   Atelier graphique        1936 Harley Davidson El Knucklehead
1   Atelier graphique  1938 Cadillac V-16 Presidential Limousine
2   Atelier graphique             1948 Porsche Type 356 Roadster
3   Atelier graphique                      1965 Aston Martin DB5
4   Atelier graphique                  1966 Shelby Cobra 427 S/C
5   Atelier graphique                      1996 Moto Guzzi 1100i
6   Atelier graphique               1999 Indy 500 Monte Carlo SS
7  Signal Gift Stores                         1911 Ford Town Car
8  Signal Gift Stores                   1917 Grand Touring Sedan
9  Signal Gift Stores        1932 Alfa Romeo 8C2300 Spider Sport


6. En base al ejercicio 3, encuentra el nombre del producto `productName` y cuantas unidades se han comprado de ese producto. Ordena los elementos de mayor a menor.

---

In [12]:
query="""
SELECT  d.productName,
        sum(c.quantityOrdered) as Tot_Ordered
from orders b 
inner join orderdetails c on (b.orderNumber = c.orderNumber)
inner join products d on (c.productCode =d.productCode)
where b.status  <>'Cancelled'
group by d.productName
order by Tot_Ordered desc
;
"""
conn = open_conection(passw)
qr_product_tot = ejecuta_query(query,conn)

df_product_tot = pd.DataFrame(qr_product_tot)
df_product_tot.head(20)

                                productName Tot_Ordered
0               1992 Ferrari 360 Spider red        1768
1                      1937 Lincoln Berline        1111
2                          1940s Ford truck        1061
3     1969 Harley Davidson Ultimate Chopper        1057
4                         1957 Chevy Pickup        1056
5                    1964 Mercedes Tour Bus        1053
6                 American Airlines: MD-11S        1050
7               1913 Ford Model T Speedster        1038
8                         1997 BMW R 1100 S        1033
9                  1962 Volkswagen Microbus        1029
10                         2002 Suzuki XREO        1028
11                 1960 BSA Gold Star DBD34        1015
12                1957 Corvette Convertible        1013
13                  1956 Porsche 356A Coupe        1013
14  1941 Chevrolet Special Deluxe Cabriolet        1008
15                 Corsair F4U ( Bird Cage)        1003
16                   1940 Ford Pickup Truck         999
17                    1996 Moto Guzzi 1100i         999
18                    1926 Ford Fire Engine         998
19                          1982 Camaro Z28         997

7. Por medio de SQLAlchemy, define la tabla `orders` definida dentro de `nabla_python`

```
+----------------+-------------+------+-----+---------+-------+
| Field          | Type        | Null | Key | Default | Extra |
+----------------+-------------+------+-----+---------+-------+
| orderNumber    | int(11)     | NO   | PRI | NULL    |       |
| orderDate      | date        | NO   |     | NULL    |       |
| requiredDate   | date        | NO   |     | NULL    |       |
| shippedDate    | date        | YES  |     | NULL    |       |
| status         | varchar(15) | NO   |     | NULL    |       |
| comments       | text        | YES  |     | NULL    |       |
| customerNumber | int(11)     | NO   | MUL | NULL    |       |
+----------------+-------------+------+-----+---------+-------+
```

----

In [13]:
Base = declarative_base()

class orders(Base):
    __tablename__ = "orders"
    orderNumber  = Column(Integer, nullable=False, primary_key=True)
    orderDate = Column(Date,nullable=False)
    requiredDate = Column(Date, nullable=False)
    shippedDate = Column(Date, nullable=True)
    status = Column(String(15),nullable=False)
    comments = Column(Text, nullable=True)
    customerNumber = Column(Integer, nullable=False, )


8. Por medio de SQLAlchemy, define la tabla `orderdetails` definida dentro de `nabla_python`

```
+-----------------+---------------+------+-----+---------+-------+
| Field           | Type          | Null | Key | Default | Extra |
+-----------------+---------------+------+-----+---------+-------+
| orderNumber     | int(11)       | NO   | PRI | NULL    |       |
| productCode     | varchar(15)   | NO   | PRI | NULL    |       |
| quantityOrdered | int(11)       | NO   |     | NULL    |       |
| priceEach       | decimal(10,2) | NO   |     | NULL    |       |
| orderLineNumber | smallint(6)   | NO   |     | NULL    |       |
+-----------------+---------------+------+-----+---------+-------+
```

---

In [14]:
class orderdetails(Base):
    __tablename__ = "orderdetails"
    extend_existing=True
    #orderNumber  = Column(Integer, nullable=False, primary_key=True)
    orderNumber  = Column(Integer,ForeignKey('orders.orderNumber'), nullable=False, primary_key=True)
    productCode = Column(String(15),nullable=False, primary_key=True)
    quantityOrdered = Column(Integer, nullable=False)
    priceEach = Column(Float, nullable=True)
    orderLineNumber = Column(Integer,nullable=False)

9. Realiza una consulta a la base de datos `nabla_python` por medio de `sqlalchemy`: encuentra los tipos de `status` existentes dentro de la tabla `orders`.

In [15]:
#creamos la sesion 
sess = SQl_Alchemy(passw)

#ejecutamos la consulta
query = (sess.query(orders.status, func.count(orders.status))
             .group_by(orders.status).all())

print('Los diferentes estatus que existen en la tabla ORDERS son:\n')
for instance in query:
     print(instance[0] + ' -->> Con un total de registros = ' + str(instance[1]))

Los diferentes estatus que existen en la tabla ORDERS son:

Shipped -->> Con un total de registros = 303
Resolved -->> Con un total de registros = 4
Cancelled -->> Con un total de registros = 6
On Hold -->> Con un total de registros = 4
Disputed -->> Con un total de registros = 3
In Process -->> Con un total de registros = 6